gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_ABB.c

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_TASK.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_TxDATA.h"


#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../Device/MEMRW.h"
#include "../DL698/DL698_Uart.h"
#include "../Display/Warning.h"
#include "../Calculate/Calculate.h"
#include "../DL698/RM_Record.h"
#include "../DL698/DL698_Uart.h"
#include "../DL698/RM_TxRxDATA_ABB.h"

//const u8 CONNECT_1[]=//读key
//{
//    0x02,0xFF,0x08,0x13,0xA1,0x08,0x00,0x00,0x10,0x62,0x41,0x15,0x86,0x4A,0xE1,
//};
//const u8 CONNECT_2[]=//远程登录口令验证返回
//{
//    0x02 ,0x18 ,0x00 ,0xA3 ,0x82 ,0x23,
//};
//const u8 CONNECT_3[]=//电量需量小数位
//{
//    0x02 ,0x05 ,0x00 ,0xA3 ,0xA8
//,0x00 ,0x02 ,0x00 ,0x05 ,0x00 ,0x00 ,0x00 ,0x00 ,0x40 ,0x0F ,0x0F
//,0x03 ,0x03
//,0xFF ,0x00 ,0x01 ,0x00 ,0x00 ,0x01 ,0x00 ,0x00 ,0x00 ,0x00 ,0x01 ,0x00
//,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00
//,0x00 ,0x00 ,0x92 ,0x95 ,0xC6,
//};
//const u8 CONNECT_4[]=//类11的配置属性
//{
//    0x02 ,0x05 ,0x00 ,0xA3 ,0xA8
//,0x0C ,0xE3 ,0x81
//,0x80
//,0x40
//,0x00 ,0x80 ,0x0C ,0x1C ,0x05 ,0x00 ,0xE4 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00
//,0x00 ,0x80 ,0x00 ,0x0C ,0x00 ,0x00 ,0x80 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00
//,0x00 ,0x00 ,0x00 ,0x00 ,0x00
//,0x03
//,0x0C
//,0x00 ,0x00 ,0x00 ,0x00 ,0x61 ,0x8E
//};
//const u8 CONNECT_101_CLASS9_1[]=//
//{
//0x02 ,0x05 ,0x00 ,0xA3 ,0xB0 ,0xA1 ,0x08 ,0x00 ,0x00 ,0x08,
//0x78 ,0x87 ,0x50 ,0x00 ,0x20 ,0x84 ,0x02 ,0x18 ,0x04 ,0x29,
//0x17 ,0x59 ,0x08 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x08,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x03 ,0x37 ,0x26 ,0x00 ,0x34,
//0x18 ,0x04 ,0x19 ,0x04 ,0x06 ,0x22 ,0x18 ,0x04 ,0x27 ,0x00,
//0x24 ,0x05 ,0x44 ,0x53 ,0x84,
//};
//const u8 CONNECT_101_CLASS11_1[]=//
//{
//    0x02,0x05 ,0x00 ,0xA3 ,0x2A ,0x04 ,0x44 ,0x24 ,0x85 ,0x56 ,0x00 ,0x00 ,0x00,
//0x00,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x02 ,0x95 ,0x31 ,0x00 ,0x00 ,0x00,
//0x04,0x59 ,0x27 ,0x50 ,0x16 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00,0x00 ,0x03 ,0x47 ,0x62 ,0x00 ,0x00 ,0x00 ,0xDF ,0x74 ,
//};
//const u8 CONNECT_101_CLASS11_2[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x04 ,0x44 ,0x24 ,0x85 ,0x56,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x02 ,0x95 ,0x31 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x03 ,0x05 ,0x86 ,0x00 ,0x00 ,0x00 ,0x37 ,0xD4 ,
//};
//const u8 CONNECT_101_CLASS11_3[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x22, 0x9A ,

//};
//const u8 CONNECT_101_CLASS11_4[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x22, 0x9A ,
//};
//const u8 CONNECT_101_CLASS11_5[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x01 ,0x15 ,0x04 ,0x97 ,0x20 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x01 ,0x04 ,0x71 ,0x00,
//0x00 ,0x00 ,0x00 ,0x84 ,0x85 ,0x67 ,0x20 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x01 ,0x11 ,0x94 ,0x00 ,0x00 ,0x00 ,0xB9, 0x2C ,
//};
//const u8 CONNECT_101_CLASS11_6[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x01 ,0x15 ,0x04 ,0x97 ,0x20 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x01 ,0x04 ,0x71 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x98 ,0x24 ,0x00 ,0x00 ,0x00 ,0xFD, 0x98,
//
//};
//const u8 CONNECT_101_CLASS11_7[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x00 ,0x04 ,0x87 ,0x96 ,0x04 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x17 ,0x39 ,0x00,
//0x00 ,0x00 ,0x00 ,0x01 ,0x33 ,0x95 ,0x48 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x16 ,0x36 ,0x00 ,0x00 ,0x00 ,0x15, 0xC8 ,
//};
//const u8 CONNECT_101_CLASS11_8[]=//
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x2A ,0x00 ,0x04 ,0x87 ,0x96 ,0x04 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x17 ,0x39 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x19 ,0x10 ,0x00 ,0x00 ,0x00 ,0x9D, 0xD0,

//};
//const u8 CONNECT_101_CLASS11_9[]=
//{
//0x02 ,0x81 ,0x00 ,0xA3 ,0x9E ,0x00 ,0x07 ,0x07 ,0x96 ,0x24 ,0x00 ,0x00,
//0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00 ,0x00,
//0x00 ,0x00 ,0x03 ,0x05 ,0x24 ,0x89 ,0x00 ,0x00 ,0x00 ,0x10 ,0x00 ,0x9B, 0x62  ,

//};

u32 RM_Rx_ABB(u32 PORTn)//UART_645接收;返回:0=正在接收,1=完成1帧接收,2=接收超时
{
    u32 i;
    u32 Pn;
    u32 p0;
    u32 p1;
    u32 RxByte;

    u8 * p8fifo;
    u16 * p16fifo;
    u8 * p8rxbuff;
    u8 * p8;
    u16 * p16timer;
    UARTCtrl_TypeDef * UARTCtrl;
    u32 RxByte_Expect = 0;

    u32 LEN_UARTnIntRx = Get_LEN_UARTnIntRx(PORTn);
    u32 LEN_UARTnRx = Get_LEN_UARTnRx(PORTn);
    UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
    p8rxbuff = (u8 *)Get_ADDR_UARTnRx(PORTn);
    p8fifo = (u8 *)(Get_ADDR_UARTn(PORTn) + 10);
    p16fifo = (u16 *)Get_ADDR_UARTn(PORTn);
    p16timer = (u16 *)Get_ADDR_UARTnTimer(PORTn);

    DMA_UARTn_RX_Pointer(PORTn);//计算DMA_UARTn接收指针值(p0)
    p0 = p16fifo[0]; //中断接收指针
    p1 = p16fifo[1]; //当前已读指针
    if((p0 >= (LEN_UARTnIntRx - 10)) || (p1 >= (LEN_UARTnIntRx - 10)))
    {
        p16fifo[0] = 0; //中断接收指针
        p16fifo[1] = 0; //当前已读指针
        p16fifo[2] = 0; //规约检查指针
        p16fifo[3] = 0;
        p16fifo[4] = 0;
        return 0;
    }

    if(UARTCtrl->CONNECT == 101)
    {
        return 1;
    }
    /*
    //---TEST---
        p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
        p8 = p8rx+ABB_SUB_OFFSET;
    	switch(UARTCtrl->CONNECT)//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
    	{
            case 1://300bps握手
            switch(p8[0])//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
    	{
    		case 1://300bps握手
                MR((u32)p8rx,(u32)CONNECT_1,sizeof(CONNECT_1));
    			UARTCtrl->RxByte=sizeof(CONNECT_1);
    			return 1;//1=接收OK
            case 2://连接密码校验
                MR((u32)p8rx,(u32)CONNECT_2,sizeof(CONNECT_2));
    			UARTCtrl->RxByte=sizeof(CONNECT_2);
    			return 1;//1=接收OK
            case 3://读类0，（电能量小数位）
                MR((u32)p8rx,(u32)CONNECT_3,sizeof(CONNECT_3));
    			UARTCtrl->RxByte=sizeof(CONNECT_3);
    			return 1;//1=接收OK
            case 4://读类2，（计费数据配置）
                MR((u32)p8rx,(u32)CONNECT_4,sizeof(CONNECT_4));
    			UARTCtrl->RxByte=sizeof(CONNECT_4);
    			return 1;//1=接收OK
            case 5://读类9，（时间）
                MR((u32)p8rx,(u32)CONNECT_101_CLASS9_1,sizeof(CONNECT_101_CLASS9_1));
    			UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS9_1);
    			return 1;//1=接收OK
            case 6://读类11，（电量）
                MR((u32)p8rx,(u32)CONNECT_101_CLASS9_1,sizeof(CONNECT_101_CLASS9_1));
    			UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS9_1);
               if(UARTCtrl->RM_SubsequentFrames==0)//0=无读后续帧,1-n=读续帧的帧号
    	        {
                        MR((u32)p8rx,(u32)CONNECT_101_CLASS11_1,sizeof(CONNECT_101_CLASS11_1));
    			        UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_1);
                }
                else
                {
                    i  = (*(p8rx+ABB_SUB_OFFSET+ABB_LEN_CLASS11)<<8);
                    i += (*(p8rx+ABB_SUB_OFFSET+ABB_LEN_CLASS11+1));
                    i=i/42;
                    switch(i)
                    {
                        case 0:
                            break;
                        case 1:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_2,sizeof(CONNECT_101_CLASS11_2));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_2);
                            break;
                        case 2:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_3,sizeof(CONNECT_101_CLASS11_3));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_3);
                            break;
                        case 3:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_4,sizeof(CONNECT_101_CLASS11_4));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_4);
                            break;
                        case 4:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_5,sizeof(CONNECT_101_CLASS11_5));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_5);
                            break;
                        case 5:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_6,sizeof(CONNECT_101_CLASS11_6));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_6);
                            break;
                        case 6:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_7,sizeof(CONNECT_101_CLASS11_7));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_7);
                            break;
                        case 7:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_8,sizeof(CONNECT_101_CLASS11_8));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_8);
                            break;
                        case 8:
                            MR((u32)p8rx,(u32)CONNECT_101_CLASS11_9,sizeof(CONNECT_101_CLASS11_9));
    			            UARTCtrl->RxByte=sizeof(CONNECT_101_CLASS11_9);
                            break;
                        default:
                            break;
                    }
                }
                return 1;//1=接收OK
            }
           case 101://101=抄表中
               return 1;
    		default:
    			return 1;
    	}

    //---TEST END---
    */

