gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_ABB.c
    RxByte = UARTCtrl->RxByte;
    if(p0 != p1)
    {   //有数据接收重置超时定时
        p16timer[0] = 500 / 10; //字节间超时定时
        if(PORTn == RS485_1PORT)
        {
            Terminal_Ram->RS485_1_RxLED_MS_Timer = 20 / 10; //11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
        }
        if(PORTn == RS485_2PORT)
        {
            Terminal_Ram->RS485_2_RxLED_MS_Timer = 20 / 10; //11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
        }
    }
    p8 = p8rxbuff + ABB_SUB_OFFSET;
    while(p0 != p1)
    {
        if(RxByte >= LEN_UARTnRx)
        {
            RxByte = 0;
        }
        i = p8fifo[p1];
        p1++;
        if(p1 >= (LEN_UARTnIntRx - 10))
        {
            p1 = 0;
        }
        p8rxbuff[RxByte] = i;
        RxByte++;
        if(RxByte == 1)
        {
            if(i != 0x02) //判断起始符02
            {
                RxByte = 0;
            }
            continue;
        }

        switch(p8[0])
        {
        case 0:
        case 1: //握手报文
            RxByte_Expect = 15;
            break;
        case 2: //密码校验
            RxByte_Expect = 6;
            break;
        case 3:
        case 4:
        case 5:
        case 6:
            if((RxByte == 2) && (p8rxbuff[1] != 0x05) && (p8rxbuff[1] != 0x81))
            {   //判断命令字是否正确
                RxByte = 0;
                continue;
            }
            if(RxByte < 3)
            {
                continue;
            }
            RxByte_Expect = 6; //p8rxbuff[2]错误和最低接收到的字节长度是6,
            if(p8rxbuff[2] == 0x00)
            {   //ACK正确
                if(RxByte >= 5)//收到帧的数据长度
                {
                    i = p8rxbuff[4] & 0x7F;
                    RxByte_Expect = i + 7;
                }
            }
            break;
        }
        if(RxByte >= RxByte_Expect)//接收数据长度足够，CRC校验判断
        {
            Pn = ABB_CRC((u8 *)&p8rxbuff[0], (RxByte_Expect - 2));
            i = (p8rxbuff[RxByte_Expect - 2] << 8) + (p8rxbuff[RxByte_Expect - 1]);
            if(Pn == i)
            {   //校验正确
                p16fifo[1] = p1; //当前已读指针
                p16fifo[2] = p1; //检查指针==读指针,免检省时
                UARTCtrl->RxByte = RxByte;
                return 1;
            }
            else
            {   //校验错误
                RxByte = 0;
            }
        }
    }

    p16fifo[1] = p1;
    UARTCtrl->RxByte = RxByte;
    if(p16timer[0] == 0x0)
    {   //超时
        return 2;//2=接收超时
    }
    return 0;
}

u32 RM_RxDATA_ABB_CHECK(u32 PORTn)//Landis帧接收数据检查,比较发收地址、控制码、数据标识、减0x33;返回0正确,1地址错,2控制码错,3数据标识错
{
    return 0;
}
//p8rx:数据起始地址，Block：类11block代表的数据，Rate:总尖峰平谷费率;
//Offset:相对于电量的偏移量,length:数据长度
//返回：bit63：是否找到；bit62-bit0：电量数据。
u64 RM_RxDATA_ABB_Electric_Power(u8* p8rx, u32 Block, u8 Rate, u8 Offset, u8 Length) //
{
    u8 i;
    u32 Data;
    u64 Data64[5] = {0};
    u8* p8;
//起始---存储于通信通道第二个缓冲区
//2个字节  类11数据起始的缓冲偏移量，已经固定为16了，故暂时没有
//2个字节  类11数据已经写进缓冲的长度，接收帧p[4]的累加,16进制数
//4个字节  KEY的缓冲，4个字节的长度
//6个字节  电量和需量小数点，类11中BLOCK1 ，BLOCK2，BLOCK3 ，BLOCK4的数据
//第16个字节  存储的数据
    p8 = p8rx + ABB_SUB_OFFSET + ABB_CLASS11_BLOCK1; //获取数据的BLOCK的数值地址
    Data = (*(p8) << 24) + (*(p8 + 1) << 16) + (*(p8 + 2) << 8) + (*(p8 + 3));
    for(i = 0; i < 4; i++) //获取接收缓存电量的偏移量i
    {
        if(Block == (Data & 0xFF))
        {
            i = 84 * (3 - i);
            break;
        }
        Data >>= 8;
    }
    if(i == 4)
    {   //没有找到对应的电量数据项，
        return Data64[0] = 0;
    }
    p8 = p8rx + ABB_SUB_OFFSET + ABB_RM_CLASS11_OFFSET + i; //分帧数据首地址+i(偏移)
    for(i = 0; i < Length; i++) //筛选出电量中有效的字节，例如“04 44 24 85 56 00 00”选出 “04 44 24 85 56”
    {
        Data64[2] = ((Data64[2] << 8) + * (p8 + Offset + i)); //峰；Data1有8个字节，是为了防止左移溢出
        Data64[3] = ((Data64[3] << 8) + * (p8 + 21 + Offset + i)); //平
        Data64[4] = ((Data64[4] << 8) + * (p8 + 42 + Offset + i)); //谷
        Data64[1] = ((Data64[1] << 8) + * (p8 + 63 + Offset + i));
    }
    Data64[0]  = bcd16_hex(Data64[1]);
    Data64[0] += bcd16_hex(Data64[2]);
    Data64[0] += bcd16_hex(Data64[3]);
    Data64[0] += bcd16_hex(Data64[4]);
    Data64[0]  = hex_bcd16(Data64[0]);
    Data64[Rate] |= ((u64)0x01 << 63);
    return Data64[Rate];
}
//四舍五入函数
//四舍五入BCD最后一位，并除以10(BCD码左移4位)
u64 Round_up_or_down(u64 n)
{
    if((n & 0x0F) >= 5) //末位大于5则进一
    {
        n >>= 4;
        n = bcd16_hex(n);
        n += 1;
        n = hex_bcd16(n);
    }
    else
    {
        n >>= 4;
    }
    return n;
}
//UART抄表数据缓冲定义
//#define LEN_RM_DI_CSD     512
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型)(ROAD时不写入总关联的OAD个数数组!!!)

u32 RM_RxDATA_ABB(u32 PORTn)//抄表接收数据处理:返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
{
    u32 i;
    u32 n;
    u32 offset;
    u32 OI, oad;
    u32 Data;
    u64 Data1;
    u32 LEN_RxDataBuff;
    u32 LEN_Data0;
    u32 LEN_Data1;
    u8* p8Array;
    u8* p8Data;
    u16* p16Data;
    u8* p8rx;
    UARTCtrl_TypeDef * UARTCtrl;
    u8* p8;

    UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
    p8rx = (u8 *)Get_ADDR_UARTnRx(PORTn); ////得到UART接收缓冲地址

    LEN_RxDataBuff = Get_LEN_UARTnFnDataBuff(PORTn); //得到UART抄表数据缓冲长度
    LEN_RxDataBuff -= (LEN_RM_DI_CSD + 4);
    p8Data = (u8 *)Get_ADDR_UARTnFnDataBuff(PORTn); //得到UART抄表数据缓冲地址
    p16Data = (u16*)(p8Data + LEN_RM_DI_CSD);
    LEN_Data1 = p16Data[1];
    if(LEN_RxDataBuff < LEN_Data1)
    {   //错
        return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
    }
    LEN_RxDataBuff -= LEN_Data1;
    p8Data += LEN_RM_DI_CSD + 4 + LEN_Data1;
    p8Array = (u8*)p8Data;
    if(UARTCtrl->RMCSDSubCount == 0) //抄表CSD子计数(非DL698抄表时)
    {
        p16Data[0] = 0; //已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
    }
    LEN_Data0 = p16Data[0];
    if(LEN_RxDataBuff < LEN_Data0)
    {   //错
        return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
    }
    LEN_RxDataBuff -= LEN_Data0;
    p8 = p8rx + LEN_UART2Rx + LEN_UART2Tx; //将接收到的后续帧数组，放到第二个缓冲区,前4个字节用来表示一些标志
    switch(UARTCtrl->CONNECT)//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
    {
    case 1://300bps握手
        switch(p8[0])
        {
        case 0:
        case 1:
            MR((u32)(p8 + ABB_KEY), (u32)(p8rx + 9), 4); //存储密码
            p8[0] = 2;
            return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
        case 2://连接密码校验
            p8[0] = 3;
            return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
        case 3://读类0，（电能量小数位）
            MR((u32)(p8 + ABB_POWER_POINT), (u32)(p8rx + 16), 2); //电量小数位和需量小数位
            p8[0] = 4;
            return 0;
        case 4://读类2，（计费数据配置）
            MR((u32)(p8 + ABB_CLASS11_BLOCK1), (u32)(p8rx + 8), 2); //类11中BLOCK1 和类11中BLOCK2
            MR((u32)(p8 + ABB_CLASS11_BLOCK3), (u32)(p8rx + 8 + 2 + 29), 2); //类11中BLOCK3 和类11中BLOCK4
            p8[0] = 5;
            return 0;
        case 5://读类9，时间
            i = p8rx[4] & 0x7F; //正在处理的帧的长度
            MR((u32)(p8 + ABB_RM_CLASS9_OFFSET), (u32)(p8rx + 5), i); //时间存储到RS485的RAM区间
            p8[0] = 6;
            return 0;
        case 6://读类11实时电量
            i = p8rx[4] & 0x7F; //正在处理的帧的长度
            offset = (p8[ABB_LEN_CLASS11] << 8) + (p8[ABB_LEN_CLASS11 + 1]);
            MR((u32)(p8 + ABB_RM_CLASS11_OFFSET + offset), (u32)(p8rx + 5), i); //存储到RS485的RAM区间
            i += offset;
            if(i > ABB_LENMAX_POWER_CLASS11)
            {   //如果接收到的电量数据长度已经大于理论值（0x016E）了，说明流程或数据出错，不去抄这只表了，抄到的数据也不处理
                UARTCtrl->CONNECT = 102;
                p8[0] = 0;
            }
            p8[ABB_LEN_CLASS11] = (i >> 8) & 0xFF;
            p8[ABB_LEN_CLASS11 + 1] =  i & 0xFF;
            if((p8rx[4] & 0x80) == 0) //bit7为0有后续帧
            {
                UARTCtrl->RM_SubsequentFrames = 1; //有后续帧
            }
            else
            {
                UARTCtrl->RM_SubsequentFrames = 0; //无后续帧
                UARTCtrl->CONNECT = 100;
                p8[0] = 0;
            }
            return 0;
        }
    case 101://101=抄表中

        break;
    case 102://关闭连接
        return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
    default://698规约连接和关闭过程
        UARTCtrl->CONNECT = 0; //DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
        return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
    }

//---后续帧---

//---后续帧结束---


//---曲线开始---

//---曲线结束---


