gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_ABB.c
//---事件类开始---


//---事件类结束---

    i = UARTCtrl->RMCSD[1]; //当前正在抄的CSD(有数据类型)
    if(i == 0)
    {   //OAD
        OI = UARTCtrl->RMCSD[2] << 8; //当前正在抄的CSD
        OI |= UARTCtrl->RMCSD[3];
        oad = (UARTCtrl->RMCSD[4] << 8) + (UARTCtrl->RMCSD[5]);
    }
    else
    {   //ROAD
        i = UARTCtrl->RMROADCount; //抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
        i *= 4;
        OI = UARTCtrl->RMCSD[7 + i] << 8; //当前正在抄的CSD
        OI |= UARTCtrl->RMCSD[7 + i + 1];
        oad = (UARTCtrl->RMCSD[7 + i + 2] << 8) + (UARTCtrl->RMCSD[7 + i + 3]);
    }
    i = OI_IC(OI); //得到接口类号;入口:对象标识OI
    switch(i)
    {
    case 1://电能量接口类,本接口类对象提供存储电能量类信息
        if(LEN_Data0 == 0)
        {
            if(LEN_RxDataBuff < 2)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        }
        switch((oad & 0xFF00) >> 8)
        {
        case 2://总及费率电能量数组∷=array 电能量
            //电能量：
            //CHOICE
            //{
            //double-long-unsigned   [6]，
            //double-long            [5]
            //}
            switch(OI)
            {
            case 0x0010://正有功
                n = 0x80;//ABB电表中的正向有功的标识
                break;
            case 0x0020://反有功
                n = 0x40; //ABB电表中的反向有功的标识
                break;
            case 0x0030://组合无功1(正无功)
                n = 0x03;   //ABB电表中的组合无功1的标识
                break;
            case 0x0040://组合无功2(反无功)
                n = 0x0C; //ABB电表中的组合无功2(反无功)的标识
                break;
            case 0x0050:
            case 0x0060:
            case 0x0070:
            case 0x0080:
            default:
                n = 0x00;
//                p8Array[0] = DataType_NULL;
//                LEN_Data0 = 1;
//                LEN_RxDataBuff -= 1;
//                p16Data[0] = LEN_Data0;
//                return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                break;
            }

            oad &= 0xFF;
            if(0 == oad)
            {   //如果是总电量则循环5次
                offset = 5;
                if(LEN_RxDataBuff < (5 * 5))
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
                p8Array[0] = DataType_array;
                p8Array[1] = offset;
                LEN_Data0 = 2;
                LEN_RxDataBuff -= 2;
                p8Data += LEN_Data0;
            }
            else
            {   //如果是分费率电量则循环1次
                offset = oad ;
                oad -= 1;
                if(LEN_RxDataBuff < 5)
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
            }
            for(i = oad; i < offset; i++)
            {
                switch(i)
                {
                case 0://总
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 0, 7); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 1://尖
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 0, 7); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 2://峰
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 0, 7); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 3://平
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 0, 7); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 4://谷
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 0, 7); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                }
                p8[0] = (Data1 >> 63) & (0x01); //这一位表示有没有找到
                if(p8[0])
                {
                    Data1 -= ((u64)0x01 << 63);
                }
                if((p8[0]) && (Data1 != 0))
                {
                    Data1 >>= 24;
                    Data1 = Round_up_or_down(Data1);
                    Data1 = bcd16_hex (Data1);
                    p8Data[0] = DataType_double_long_unsigned;
                    p8Data[1] = Data1 >> 24;
                    p8Data[2] = Data1 >> 16;
                    p8Data[3] = Data1 >> 8;
                    p8Data[4] = Data1 >> 0;
                    p8Data += 5;
                    LEN_Data0 += 5;
                }
                else
                {
                    p8Data[0] = 0; //空
                    p8Data += 1;
                    LEN_Data0 += 1;
                }
            }

            p16Data[0] = LEN_Data0;
            break;
//				case 4://高精度总及费率电能量数组∷=array 高精度电能量
//				//高精度电能量：
//				//CHOICE
//				//{
//				//long64-unsigned        [21]，
//				//long64                 [20]
//				//}

//					break;
        default:
            return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
        }
        break;
    case 2://最大需量接口类,本接口类对象提供存储最大需量类信息
        if(LEN_Data0 == 0)
        {
            if(LEN_RxDataBuff < 2)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        }

        switch((oad & 0xFF00) >> 8) //属性
        {
        case 2://总及费率最大需量数组∷=array 最大需量及发生时间
            //最大需量及发生时间∷=structure
            //{
            //  最大需量值 CHOICE，
            //  发生时间   date_time_s
            //}
            //最大需量值 ：
            //CHOICE
            //{
            //double-long            [5]，
            //double-long-unsigned   [6]
            //}
            switch(OI)
            {
            case 0x1010://正有功最大需量
                n = 0x80;//ABB电表中的正向有功的标识
                break;
            case 0x1020://反有功最大需量
                n = 0x40;//ABB电表中的正向有功的标识
                break;
            case 0x1030://组合无功1(正无功)最大需量
                n = 0x03;//ABB电表中的正向有功的标识
                break;
            case 0x1040://组合无功2(反无功)最大需量
                n = 0x0C;//ABB电表中的正向有功的标识
                break;
            default:
                n = 0x00;
                break;
            }

            oad &= 0xFF;
            if(0 == oad)
            {   //如果是总电量则循环5次
                offset = 5;
                if(LEN_RxDataBuff < (13 * 5))
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
                p8Array[0] = DataType_array;
                p8Array[1] = offset;
                LEN_Data0 = 2;
                LEN_RxDataBuff -= 2;
                p8Data += LEN_Data0;
            }
            else
            {   //如果是分费率电量则循环1次
                offset = oad ;
                oad -= 1;
                if(LEN_RxDataBuff < 13)
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
            }
            for(i = oad; i < offset; i++)
            {
                switch(i)
                {
                case 0://总
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 7, 3); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 1://尖
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 7, 3); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 2://峰
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 7, 3); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 3://平
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 7, 3); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                case 4://谷
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 7, 3); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    break;
                }
                p8[0] = (Data1 >> 63) & (0x01); //这一位表示有没有找到
                if(p8[0])
                {
                    Data1 -= ((u64)0x01 << 63);
                }
                if((p8[0]) && (Data1 != 0))
                {
                    Data1 = Round_up_or_down(Data1);
                    Data1 = bcd16_hex (Data1);
                    p8Data[0] = DataType_structure;
                    p8Data[1] = 2;
                    p8Data += 2;
                    p8Data[0] = DataType_double_long_unsigned;
                    p8Data[1] = Data1 >> 24;
                    p8Data[2] = Data1 >> 16;
                    p8Data[3] = Data1 >> 8;
                    p8Data[4] = Data1 >> 0;
                    p8Data += 5;
                    //发生时间
                    Data1 = RM_RxDATA_ABB_Electric_Power(p8rx, n, i, 10, 5); //0x01<<32位表示有没有找到，后32位是16进制的电量数据
                    p8[0] = Data1 & ((u64)0x01 << 63); //这一位表示有没有找到
                    if(p8)
                    {
                        Data1 -= ((u64)0x01 << 63);
                        p8Data[0] = DataType_date_time_s;
                        Data = Data1 & ((u64)0xFF << 32);
                        Data = bcd_hex(Data);
                        Data += 2000;
                        p8Data[1] = Data >> 8; //年
                        p8Data[2] = Data;
                        Data = Data1 & (0x7F << 24);
                        Data = bcd_hex(Data);
                        p8Data[3] = Data; //月
                        Data = Data1 & (0xFF << 16);
                        Data = bcd_hex(Data);
                        p8Data[4] = Data; //日
                        Data = Data1 & (0xFF << 8);
                        Data = bcd_hex(Data);
                        p8Data[5] = Data; //时
                        Data = Data1 & (0xFF);
                        Data = bcd_hex(Data);
                        p8Data[6] = Data; //分
                        p8Data[7] = 0;   //秒
                        p8Data += 8;
                        LEN_Data0 += 2 + 5 + 8;
                    }
                    else
                    {
                        p8Data[0] = 0; //空
                        p8Data += 1;
                        LEN_Data0 += 1;
                    }
                }
                else
                {
                    p8Data[0] = 0; //空
                    p8Data += 1;
                    LEN_Data0 += 1;
                }
            }
            p16Data[0] = LEN_Data0;
            break;
        default:
            return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
        }

        break;
    case 3://分相变量接口类,本接口类对象提供存储电压、电流、相角等分相变量类信息
        //分相数值组∷=array 分相数值
        //数值组按A相、B相、C相、N线顺序排列，其中：仅电流有N线，另外，当接线方式为单相时，A、B、C三相改为A相（某一相）。
        if(LEN_Data0 == 0)
        {
            if(LEN_RxDataBuff < 2)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        }
        switch((oad & 0xFF00) >> 8) //属性
        {
        case 2://分相数值组
            switch(OI)
            {
            case 0x2000://电压
            case 0x2001://电流
            case 0x2002://电压相角
            case 0x2003://电压电流相角
            case 0x200B://电压波形失真度
            case 0x200C://电流波形失真度
                break;
            default:
                if(LEN_Data0 == 0)
                {
                    if(LEN_RxDataBuff < 2)
                    {   //缓冲长度不够
                        return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                    }
                    p8Array[0] = DataType_NULL;
                    LEN_Data0 = 1;
                    LEN_RxDataBuff -= 1;
                }
                p16Data[0] = LEN_Data0;
                return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }

            oad &= 0xFF;
            if(0 == oad)
            {   //
                offset = 3;
                if(LEN_RxDataBuff < (3 * 3))
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
                p8Array[0] = DataType_array;
                p8Array[1] = offset;
                LEN_Data0 = 2;
                LEN_RxDataBuff -= 2;
                p8Data += LEN_Data0;
            }
            else
            {   //
                offset = oad ;
                oad -= 1;
                if(LEN_RxDataBuff < 3)
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
            }
            for(i = oad; i < offset; i++)
            {
                p8Data[0] = DataType_NULL; //空
                p8Data += 1;
                LEN_Data0 += 1;
            }
            p16Data[0] = LEN_Data0;
            break;

        case 4:
            switch(OI)
            {
            case 0x2001://零线电流
                p8Data[0] = DataType_NULL; //空
                LEN_Data0 += 1;
                p16Data[0] = LEN_Data0;
                break;
            default:
                return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        default:
            return 0;
        }
//			break;
    case 4://功率接口类,本接口类对象提供存储功率、功率因数等信息
        //总及分相数值组∷=array 总或分相数值
        //数值组按总、A相、B相、C相顺序排列，当接线方式为单相时，为总、A相（某一相）
        if(LEN_Data0 == 0)
        {
            if(LEN_RxDataBuff < 2)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        }
        switch((oad & 0xFF00) >> 8) //属性
        {
        case 2://总及分相数值组
            switch(OI)
            {
            case 0x2004://有功功率
            case 0x2005://无功功率
            case 0x2006://视在功率
            case 0x2007://一分钟平均有功功率
            case 0x2008://一分钟平均无功功率
            case 0x2009://一分钟平均视在功率
            case 0x200A://功率因数
                break;
            default:
                if(LEN_Data0 == 0)
                {
                    if(LEN_RxDataBuff < 2)
                    {   //缓冲长度不够
                        return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                    }
                    p8Array[0] = DataType_NULL;
                    LEN_Data0 = 1;
                    LEN_RxDataBuff -= 1;
                }
                p16Data[0] = LEN_Data0;
                return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
            oad &= 0xFF;
            if(0 == oad)
            {   //
                offset = 4;
                if(LEN_RxDataBuff < (5 * 4))
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
                p8Array[0] = DataType_array;
                p8Array[1] = offset;
                LEN_Data0 = 2;
                LEN_RxDataBuff -= 2;
                p8Data += LEN_Data0;
            }
            else
            {   //
                offset = oad ;
                oad -= 1;
                if(LEN_RxDataBuff < 5)
                {   //缓冲长度不够
                    return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                }
            }
            for(i = oad; i < offset; i++)
            {
                p8Data[0] = 0; //空
                p8Data += 1;
                LEN_Data0 += 1;
            }

            p16Data[0] = LEN_Data0;
        default:
            return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
        }
//		case 5://谐波变量接口类,本接口类对象提供存储谐波变量类信息
//			break;
    case 6://数据变量接口类,本接口类对象提供存储过程值或与过程值单元相关的状态值信息
        if(LEN_Data0 == 0)
        {
            if(LEN_RxDataBuff < 2)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        }
        switch((oad & 0xFF00) >> 8)
        {
        case 2:
            switch(OI)
            {
            case 0x2131:
            case 0x2132:
            case 0x2133:
            case 0x2014://电表运行状态字1-7
            case 0x202D://（当前）透支金额  数据类型：double-long-unsigned，单位：元，换算：-2
            default:
                if(LEN_Data0 == 0)
                {
                    if(LEN_RxDataBuff < 2)
                    {   //缓冲长度不够
                        return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
                    }
                    p8Array[0] = DataType_NULL;
                    LEN_Data0 = 1;
                    LEN_RxDataBuff -= 1;
                }
                p16Data[0] = LEN_Data0;
                return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
        default:
            return 0;
        }
//		case 7://事件对象接口类,本接口类对象提供配置、存储事件记录类信息
//			break;
    case 8://参数变量接口类,本接口类对象提供存储终端的各种参数类信息
        switch(OI)
        {
        case 0x2021://数据冻结时间
            if(LEN_RxDataBuff < 8)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
            p8Data += LEN_Data0;
            p8Array = (u8*)p8Data;
            p8Data[0] = DataType_date_time_s;
            Get_date_time_s(p8Data + 1); //得到date_time_s共7字节
            p8Data += 8;
            LEN_Data0 += 8;
            LEN_RxDataBuff -= 8;
            p16Data[0] = LEN_Data0;
            break;
        case 0x4000://日期时间
            if(LEN_RxDataBuff < 8)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
            p8Data += LEN_Data0;
            p8 = p8rx + ABB_SUB_OFFSET + ABB_RM_CLASS9_OFFSET + 27;
            if(p8)
            {
                for(i=0;i<6;i++)
                {
                    Data1 <<= 8;
                    Data1 += p8[i];
                }
                i = Check_YMDHMS(Data1); //BCD日期检查
                if(i==1)
                {
                    p8Array[0] = DataType_NULL;
                    LEN_Data0 = 1;
                    LEN_RxDataBuff -= 1;
                }
                else
                {
                    p8Data[0] = DataType_date_time_s;
                    Data = p8[0];
                    Data = bcd_hex(Data);
                    Data += 2000;
                    p8Data[1] = Data >> 8; //年
                    p8Data[2] = Data;
                    Data = p8[1];
                    Data = bcd_hex(Data);
                    p8Data[3] = Data; //月
                    Data = p8[2];
                    Data = bcd_hex(Data);
                    p8Data[4] = Data; //日
                    Data = p8[3];
                    Data = bcd_hex(Data);
                    p8Data[5] = Data; //时
                    Data = p8[4];
                    Data = bcd_hex(Data);
                    p8Data[6] = Data; //分
                    Data = p8[5];
                    Data = bcd_hex(Data);
                    p8Data[7] = Data; //秒
                    LEN_Data0 += 8;
                    LEN_RxDataBuff -= 6;
                }
            }
            else
            {
                p8Array[0] = DataType_NULL;
                LEN_Data0 = 1;
                LEN_RxDataBuff -= 1;
            }
            p16Data[0] = LEN_Data0;
            break;
        case 0x202C://（当前）钱包文件 剩余金额	double-long-unsigned（单位：元，换算：-2）， 购电次数	double-long-unsigned
            break;
        }
        break;
//		case 9://冻结数据接口类,本接口类对象提供配置、存储冻结数据及其相关信息
//			break;
//		case 10://采集监控接口类
//			break;
//		case 11://集合接口类,本接口类对象提供配置、存储终端采集数据及其相关信息
//			break;
//		case 12://脉冲计量接口类
//			break;
//		case 13://负荷控制对象接口类,本接口类对象提供负荷管理有关的控制功能
//			break;
//		case 14://区间统计接口类,本接口类对象提供依据配置参数判定、统计与越限相关的信息
//			break;
//		case 15://累加平均接口类,本接口类对象提供对相同物理属性的数值进行累加、平均的运算功能
//			break;
//		case 16://极值工具接口类,本接口类对象提供采集或生成最大、最小值及其发生时间
//			break;
//		case 17://显示接口类,本接口类对象提供与终端显示或对外打印相关的信息
//			break;
//		case 18://文件传输接口类,本接口类对象提供终端实现上传和下载文件的功能
//			break;
//		case 19://设备管理接口类,
//			break;
//		case 20://应用连接接口类
//			break;
//		case 21://ESAM接口类
//			break;
//		case 22://输入输出设备接口类
//			break;
//		case 23://总加组接口类
//			break;
//		case 24://分项事件对象接口类,本接口类对象提供配置、存储分项事件记录类信息
//			break;
//		case 25://无线公网通信接口类
//			break;
//		case 26://以太网通信接口类
//			break;
    default:
        if(LEN_Data0 == 0)
        {
            if(LEN_RxDataBuff < 2)
            {   //缓冲长度不够
                return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
            }
            p8Array[0] = DataType_NULL;
            LEN_Data0 = 1;
            LEN_RxDataBuff -= 1;
        }
        p16Data[0] = LEN_Data0;
        break;
        //测试看未处理的OI值
//        i = OI_IC(OI); //得到接口类号;入口:对象标识OI
//        if(i)
//        {
//            i = i;
//        }
//        return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
    }
    return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
}




















